cmsis-svd/cmsis-svd/data/Renesas/R7FA6T1.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="ACMPHS1">
            <name>ACMPHS2</name>
            <description>High-Speed Analog Comparator 2</description>
            <baseAddress>0x40085200</baseAddress>
        </peripheral>
        <peripheral derivedFrom="ACMPHS1">
            <name>ACMPHS3</name>
            <description>High-Speed Analog Comparator 3</description>
            <baseAddress>0x40085300</baseAddress>
        </peripheral>
        <peripheral derivedFrom="ACMPHS1">
            <name>ACMPHS4</name>
            <description>High-Speed Analog Comparator 4</description>
            <baseAddress>0x40085400</baseAddress>
        </peripheral>
        <peripheral derivedFrom="ACMPHS1">
            <name>ACMPHS5</name>
            <description>High-Speed Analog Comparator 5</description>
            <baseAddress>0x40085500</baseAddress>
        </peripheral>
        <peripheral>
            <name>TSD</name>
            <description>Temperature Sensor Data</description>
            <baseAddress>0x407FB17C</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>TSCDR</name>
                    <description>Temperature Sensor Calibration Data Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFF000</resetMask>
                    <fields>
                        <field>
                            <name>TSCD</name>
                            <description>Temperature sensor calibration data is a digital value obtained using the 12-bit A/D converter unit 0 to convert the voltage output by the temperature sensor under the condition Ta = Tj = 127°C and AVCC0 = 3.3 V.</description>
                            <lsb>0</lsb>
                            <msb>11</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000000000000000000.</description>
                            <lsb>12</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
    </peripherals>
</device>